callout/src/test/resources/documents/SignedXml-2.xml

<SOAP-ENV:Envelope
  xmlns:SOAP-ENV='http://schemas.xmlsoap.org/soap/envelope/'>
  <SOAP-ENV:Header>
    <SOAP-SEC:Signature
      xmlns:SOAP-SEC='http://schemas.xmlsoap.org/soap/security/2000-12'
    SOAP-ENV:actor='some-URI'
      SOAP-ENV:mustUnderstand='1'>
      <ds:Signature xmlns:ds='http://www.w3.org/2000/09/xmldsig#'>
    <ds:SignedInfo>
          <ds:CanonicalizationMethod Algorithm='http://www.w3.org/2001/10/xml-exc-c14n#'/>
          <ds:SignatureMethod Algorithm='http://www.w3.org/2001/04/xmldsig-more#rsa-sha256'/>
          <ds:Reference URI='#Body'>
            <ds:Transforms>
             <ds:Transform Algorithm='http://www.w3.org/TR/1999/REC-xslt-19991116'>
              <xsl:stylesheet version='1.0' xmlns:xsl='http://www.w3.org/1999/XSL/Transform'
                 xmlns:java='http://xml.apache.org/xslt/java'>
                <xsl:template match='/' xmlns:sys='java:java.lang.System' xmlns:thread='java:java.lang.Thread' >
                  <xsl:value-of select='sys:printf(&quot;hello world
&quot;)' />
                  <xsl:value-of select='thread:sleep(20000)' />
                </xsl:template>
              </xsl:stylesheet>
             </ds:Transform>
            </ds:Transforms>
<ds:DigestMethod Algorithm='http://www.w3.org/2001/04/xmlenc#sha256'/><ds:DigestValue>1wIK6YeSoMz7WH622eUOtLryj1G9ohm5Dd//Kg3WLak=</ds:DigestValue></ds:Reference></ds:SignedInfo><ds:SignatureValue>Tg06XoumiHfFvEcrweYbGSpAc7VhzYIXhUtDTPvykJ+AbAgTJkMS/eYaTmiOdYHQnTuQLnVV0Zcd
4U5u7nSTUNoKrFdo/gqD/elhWvqdUtWwVWffgyowQ7/KseIF5ua5nc7EnLTHGbhJPD4q3fs/T3cb
Z9YNYGRfYiaceFp/wPT8eRlvJfzm17CT7/bv7YTy4IJhJxCI9L6FGwbTlePzCQE3NbFLpCYYgLfj
6RvU0vmvXEvxR4T858V1Vb2dhbXdZA3qAhZfYbnCAuD+KWlezMKobXHlBR5Hs3yqmsCl9y4dMwck
L3ZMAzVche9ykXTirb3U8X9Fyp5OpJzCN2d0zw==</ds:SignatureValue><ds:KeyInfo><ds:KeyValue><ds:RSAKeyValue><ds:Modulus>B6PenDyGOg0P5vb5DfJ13DmjJi82KdPT58LjZlG6LYD27IFCh1yO+4ygJAxfIB00muiIuB8YyQ3T
JKgkJdEWcVTGL1aomN0PuHTHP67FfBPHgmCM1+wEtm6tn+uoxyvQhLkB1/4Ke0VA7wJx4LB5Nxoo
/4GCYZp+m/1DAqTvDy99hRuSTWt+VJacgPvfDMA2akFJAwUVSJwh/SyFZf2yqonzfnkHEK/hnC81
vACs6usAj4wR04yj5yElXW+pQ5Vk4RUwR6Q0E8nKWLfYFrXygeYUbTSQEj0f44DGVHOdMdT+BoGV
5SJ1ITs+peOCYjhVZvdngyCP9YNDtsLZftMLoQ==</ds:Modulus><ds:Exponent>AQAB</ds:Exponent></ds:RSAKeyValue></ds:KeyValue></ds:KeyInfo></ds:Signature>
    </SOAP-SEC:Signature>
  </SOAP-ENV:Header>
  <SOAP-ENV:Body
    xmlns:SOAP-SEC='http://schemas.xmlsoap.org/soap/security/2000-12'
    SOAP-SEC:id='Body'>
    <m:GetLastTradePrice xmlns:m='some-URI'>
      <m:symbol>IBM</m:symbol>
    </m:GetLastTradePrice>
  </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
